results/data/run1/jvm-db/erik-laptop/quarkus-io-thread-20000-WARM-UP.wrk2.out
Running 1m test @ http://erik-pc.local:8080/fruits
  4 threads and 100 connections
  Thread calibration: mean lat.: 2.347ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.549ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.435ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.269ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.38ms  818.22us   9.96ms   66.12%
    Req/Sec     5.28k   762.37     9.11k    73.58%
  1198805 requests in 1.00m, 194.36MB read
Requests/sec:  19979.10
Transfer/sec:      3.24MB